Tekla Open API Reference for Tekla Structures 2025
Loop Methods
The Loop type exposes the following members.
Methods
Name | Description
GetVertexEnumerator
 Gets a new vertex enumerator.
Top
See Also
Reference
Loop Class
Tekla.Structures.Solid Namespace